Repository: Aalaa22/dubaii_2025_10_26
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Sign Up
ar: انشاء حساب

source: User Name
ar: اسم المستخدم

source: Phone
ar: رقم الهاتف

source: Password
ar: كلمة المرور

source: Referral Code
ar: كودالخصم

# agreeTerms
source: I Agree Terms & Conditions
ar: أوافق على الشروط والأحكام

source: Register
ar: انشاء

source: Or
ar: أو

source: Guest Login
ar: دخول كضيف

source: Email Sign Up
ar: تسجيل بالبريد الإلكتروني

source: Log In
ar: تسجيل دخول

# haveAccount
source: Already Have An Account?
ar: هل لديك حساب بالفعل؟

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Email Login
ar: الدخول بالبريد

# dontHaveAccount
source: Don't Have An Account?
ar: ليس لديك حساب؟

source: Create Account
ar: إنشاء حساب

source: Phone Login
ar: دخول بالهاتف

source: My Profile
ar: ملفي الشخصي

source: Create Agent Code
ar: إنشاء كود الخصم

source: Notifications
ar: الإشعارات

source: Language
ar: اللغة

source: Contact Us
ar: اتصل بنا

# termsAndConditions
source: Terms & Conditions
ar: الشروط والأحكام

source: Support Center
ar: مركز الدعم

source: Privacy & Security
ar: الخصوصية والأمان

source: Logout
ar: تسجيل الخروج

source: WhatsApp
ar: واتساب

source: Email
ar: البريد الإلكتروني

source: Advertiser Name
ar: اسم المُعلِن

source: Advertiser Type
ar: نوع المُعلِن

source: Advertiser Logo
ar: شعار المُعلِن

source: Upload Your Logo
ar: ارفع شعارك

source: Advertiser Location
ar: موقع المُعلِن

source: Address
ar: العنوان

source: Locate Me
ar: حدد موقعي

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Optional
ar: اختياري

source: phone sign Up
ar: دخول برقم الهاتف

source: Premium
ar: مميز

source: Price
ar: السعر

# placeName
source: Al Manara Motors
ar: منارة موتورز

source: Back
ar: رجوع

source: Please select emirate
ar: يرجى اختيار الإمارة

source: Please select district
ar: يرجى اختيار المنطقة

source: Please select category
ar: يرجى اختيار الفئة

# forgetyourpass
source: Forgot Your Password?
ar: نسيت كلمة المرور؟

# enterphone
source: Enter Your phone
ar: ادخل رقم الهاتف

source: Send Code
ar: ارسل الكود

# enteremail
source: Enter Your Email
ar: ادخل البريد الالكتروني

# verifnum
source: Verify Your Number
ar: تحقّق من رقمك

# phoneverify
source: We've sent an whatsApp with an activation code to your phone
ar: أرسلنا رسالة نصية تحتوي على رمز التفعيل إلى رقم هاتفك

# emilverify
source: We've sent an Email with an activation code to your Email yourname@example.Com
ar: yourname@example.Com أرسلنا بريدًا إلكترونيًا يحتوي على رمز التفعيل إلى بريدك

source: Verify
ar: تحقّق

# resetpass
source: Reset Password
ar: إعادة تعيين كلمة المرور

# newpass
source: New password
ar: كلمة المرور الجديدة

# confirmpass
source: Confirm Password
ar: تأكيد كلمة المرور

source: Confirm
ar: تأكيد

source: Favorites
ar: المفضلة

# favoritesLoadFailed
source: Failed to load favorites: {error}
ar: فشل تحميل المفضلة: {error}

# favoriteRemovedSuccess
source: Ad removed from favorites
ar: تم إزالة الإعلان من المفضلة

# favoriteRemoveFailed
source: Failed to remove ad: {error}
ar: فشل إزالة الإعلان: {error}

source: Retry
ar: إعادة المحاولة

# loginRequiredTitle
source: Login required
ar: تسجيل الدخول مطلوب

# loginRequiredDescription
source: You must log in first to view your favorites
ar: يجب تسجيل الدخول أولاً لعرض المفضلة

# loginAction
source: Login
ar: تسجيل الدخول

# favoritesEmptySection
source: No favorite items in this section
ar: لا توجد عناصر مفضلة في هذا القسم

# removeFromFavoritesTitle
source: Remove from Favorites
ar: إزالة من المفضلة

# removeFromFavoritesMessage
source: Are you sure you want to remove this ad from favorites?
ar: هل أنت متأكد من إزالة هذا الإعلان من المفضلة؟

source: Remove
ar: إزالة

source: Please log in first
ar: يرجى تسجيل الدخول أولاً

source: Ad ID not available
ar: معرّف الإعلان غير متوفر

# contactLabel
source: Contact: {info}
ar: تواصل: {info}

# couldNotLaunch
source: Could not launch {url}
ar: تعذر فتح {url}

# whatsappInvalid
source: Invalid WhatsApp number format
ar: صيغة رقم واتساب غير صحيحة

# whatsappNotAvailable
source: WhatsApp number not available
ar: رقم واتساب غير متوفر

# phoneInvalid
source: Invalid phone number format
ar: صيغة رقم الهاتف غير صحيحة

# phoneNotAvailable
source: Phone number not available
ar: رقم الهاتف غير متوفر

# whatsappLabel
source: WhatsApp: {number}
ar: واتساب: {number}

# phoneLabel
source: Phone: {number}
ar: هاتف: {number}

source: Car Sales
ar: بيع السيارات

source: Real Estate
ar: العقارات

# electronics
source: Electronics & Home Appliances
ar: الإلكترونيات و الأجهزة المنزلية

source: Jobs
ar: وظائف

source: Car Rent
ar: تأجير السيارات

source: Car Services
ar: خدمات السيارات

source: Restaurants
ar: مطاعم

source: Other Services
ar: خدمات أخرى

source: Enjoy Free Ads
ar: استمتع بالإعلانات المجانية

# enterpassword
source: Enter Your Password
ar: أدخل كلمة المرور

# pleaseEnterPassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# passwordRequiredToCompleteLogin
source: Please enter password to complete login
ar: يرجى إدخال كلمة المرور لإكمال تسجيل الدخول

# loginError
source: An error occurred during login
ar: حدث خطأ في تسجيل الدخول

# unexpectedError
source: Unexpected error: {error}
ar: حدث خطأ غير متوقع: {error}

source: Logging in...
ar: جاري تسجيل الدخول...

# byContinueIAgreeTo
source: By continuing I agree to the
ar: بالمتابعة أوافق على

source: and
ar: و

source: Privacy Policy
ar: سياسة الخصوصية

# passwordResetComingSoon
source: Password reset will be available soon
ar: ميزة استعادة كلمة المرور ستكون متاحة قريباً

source: Home
ar: الرئيسية

# srtting
source: Settings
ar: الإعدادات

source: Manage
ar: الإدارة

# post
source: Posting
ar: مكان إضافةإعلان

# editprof4
source: Edit my Profile
ar: تعديل الملف الشخصي

# editing1
source: Editing
ar: جاري التعديل

# editit2
source: Do you want to edit your profile
ar: هل تريد تعديل ملفك الشخصي؟

# edit3
source: Edit
ar: تعديل

source: Discover Best Cars Deals
ar: اكتشف أفضل عروض السيارات

source: Choose Make
ar: اختر الماركة

source: Choose Model
ar: اختر الطراز

source: Search
ar: بحث

source: Click For Amazing Daily Cars Deals
ar: اضغط لرؤية عروض السيارات اليومية المميزة

source: Top Premium Dealers
ar: أفضل الوكلاء المميزين

source: See All Ads
ar: عرض كل الإعلانات

source: Smart Search
ar: بحث ذكي

source: Km
ar: كم

source: Year
ar: السنة

source: Trim
ar: الفئة

# sort
source: Sort By The Nearest
ar: فرز حسب الأقرب

# ad
source: ADS NO:
ar: عدد الإعلانات

source: Car Details
ar: تفاصيل السيارة

source: Car Type
ar: نوع السيارة

source: Trans Type
ar: نوع ناقل الحركة

source: Color
ar: اللون

source: Interior Color
ar: اللون الداخلي

source: Fuel Type
ar: نوع الوقود

source: Warranty
ar: الضمان

source: Doors No
ar: عدد الأبواب

source: Seats No
ar: عدد المقاعد

source: Engine Capacity
ar: سعة المحرك

source: Cylinders
ar: عدد الأسطوانات

source: Horse Power
ar: قوة المحرك (حصان)

source: Steering Side
ar: جهة المقود

source: Description
ar: الوصف

source: Location
ar: الموقع

source: Agent
ar: الوكيل

source: View All Ads
ar: عرض جميع الإعلانات

source: Report This Ad
ar: الإبلاغ عن هذا الإعلان

# use_this_space_for_ads
source: Contact us To Use This Space For Your Ads
ar: تواصل معنا لاستخدام هذه المساحة لإعلاناتك

source: Ad not found.
ar: لم يتم العثور على الإعلان.

# errorFetchingData
source: An error occurred while fetching data: {error}
ar: حدث خطأ أثناء جلب البيانات: {error}

source: New main image selected
ar: تم اختيار صورة رئيسية جديدة

source: Current main image
ar: الصورة الرئيسية الحالية

# saveSuccess
source: Saved successfully
ar: تم الحفظ بنجاح

# saveFailed
source: Save failed: {error}
ar: فشل الحفظ: {error}

# noAdIdForUpdate
source: No ad ID to update
ar: لا يوجد معرّف للإعلان للتحديث

source: No changes to save
ar: لا توجد تغييرات للحفظ

# cannotAddMoreImages
source: Cannot add more images. Maximum is {max} images
ar: لا يمكن إضافة المزيد من الصور. الحد الأقصى {max} صور

# limitedImagesSelected
source: Only {count} images selected. Maximum {max} images total
ar: تم اختيار {count} صورة فقط. الحد الأقصى {max} صورة إجمالية

# rankAdInProgress
source: Ranking the ad...
ar: جاري ترقية الإعلان...

# rankAdSuccess
source: Ad ranked successfully
ar: تم ترقية الإعلان بنجاح

# rankAdFailed
source: Failed to rank the ad
ar: فشل في ترقية الإعلان

# priority_first_premium
source: 🌟 Top Premium Ads
ar: 🌟 إعلانات مميزة جدًا

# priority_premium
source: 💎 Premium Ads
ar: 💎 إعلانات Premium

# priority_featured
source: 🚀 Featured Ads
ar: 🚀 إعلانات Featured

# priority_free
source: 📢 Free Ads
ar: 📢 إعلانات مجانية

source: Add to Favorite
ar: إضافة إلى المفضلة

# confirm_add_to_favorite
source: Do you want to add this item to favorites?
ar: هل تريد إضافة هذا العنصر إلى المفضلة؟

source: Yes
ar: نعم

# added_to_favorite
source: Item added to favorites
ar: تمت إضافة العنصر إلى المفضلة

source: remove from favorite
ar: حذف من المفضلة؟

source: confirm remove from favorite
ar: تأكيد الحذف من المفضلة

# invisibleInfo
source: When enabled, others won’t know that you viewed their ad or interacted with it.
ar: عند تفعيل هذا الخيار، لن يتمكن الآخرون من معرفة أنك شاهدت إعلانهم أو تفاعلت معه.

# invisibleTitle
source: Invisible Browsing
ar: التصفح المخفي

# invisibleInfoTitle
source: What is Invisible?
ar: ما هو وضع التخفي؟

source: Ok
ar: تمام

# discover_deals
source: Discover Best Rental Deals
ar: اكتشف أفضل عروض الإيجار

# click_for_deals
source: Click For Amazing Daily Rental Deals
ar: اضغط للحصول على عروض إيجار يومية رائعة

# discover_real_estate
source: Discover Best Properties Deals
ar: اكتشف أفضل عروض العقارات

source: Emirate
ar: إمارة

source: District
ar: منطقة

source: Property Type
ar: نوع العقار

source: Contract Type
ar: نوع العقد

# click_for_deals_real_estate
source: Click For Amazing Properties Deals
ar: اضغط لاستعراض أفضل عروض العقارات

# discover_elect
source: Discover Best Electronics & Appliances
ar: اكتشف أفضل عروض الإلكترونيات

source: Section Type
ar: نوع القسم

# click_for_deals_elect
source: Click For Amazing Electronics & Home Appliances Deals
ar: اضغط لاستعراض أفضل عروض الأجهزة الإلكترونية والأدوات المنزلية

source: Category Type
ar: نوع التصنيف

# click_for_deals_job
source: Click For Amazing Job Offers
ar: اضغط لرؤية عروض الوظائف المميزة

# discover_best_job
source: Discover Best Job Offers
ar: اكتشف أفضل عروض الوظائف

# service_type
source: Service name
ar: اسم الخدمة

# click_for_deals_car_service
source: Click For Amazing Cars Services Deals
ar: اضغط لرؤية أفضل عروض خدمات السيارات

# discover_car_service
source: Discover Best Cars Services Deals
ar: اكتشف أفضل عروض خدمات السيارات

# district_choose
source: District
ar: اختر المنطقة

# click_daily_offers
source: Click For Amazing Daily Offers
ar: اضغط لرؤية العروض اليومية

# discover_restaurants_offers
source: Discover Best Restaurants Offers
ar: اكتشف أفضل عروض المطاعم

# click_daily_servir_offers
source: Click For Amazing Services Offers
ar: اضغط لرؤية عروض الخدمات المميزة

# discover_service_offers
source: Discover Best Services Offers
ar: اكتشف أفضل عروض الخدمات

source: Section
ar: القسم

source: Product
ar: المنتج

# electronics2
source: Electronics &
ar: الإلكترونيات و

# electronics3
source: Home Appliances
ar: الأجهزة المنزلية

source: Category
ar: الفئة

source: Type
ar: النوع

source: Contract
ar: العقد

source: Service
ar: الخدمة

source: Place An Ad
ar: نشر

source: Featured
ar: مُفضل

source: Free
ar: مجاني

# appearance_top
source: Appearance On Top Of Search List
ar: الظهور في أعلى نتائج البحث

# appearance_nearest
source: Appearance For The Nearest Viewers
ar: الظهور للمستخدمين الأقرب

# appearance_after_star
source: Appearance After Premium
ar: الظهور بعد إعلان مميز ⭐

# appearance_after_premium
source: Appearance After Premium Ads
ar: الظهور بعد الإعلانات المميزة

# appearance_after_featured
source: Appearance After Featured Ads
ar: الظهور بعد الإعلانات المُفضلة

# daily_refresh
source: Enabled Daily Refresh
ar: تحديث يومي مفعّل

source: Cost
ar: السعر

# for_days
source: For [{days}] Days
ar: لمدة [{days}] يومًا

source: Submit
ar: إرسال

# top_of_day_note
source: Top Of The Day Comes First On The Search List
ar: يظهر إعلان اليوم أولًا في نتائج البحث

# appTitle
source: Cars Sales Ads
ar: إعلانات بيع السيارات

# toggleLang
source: العربية
ar: English

source: Make
ar: النوع (الماركة)

source: Model
ar: الموديل

source: Specs
ar: المواصفات

source: Title
ar: العنوان

source: Car Type
ar: نوع السيارة

source: Trans Type
ar: نوع الجير

source: Fuel Type
ar: نوع الوقود

source: Interior Color
ar: اللون الداخلي

source: Engine Capacity
ar: سعة المحرك

source: Horse Power
ar: قوة الحصان

source: Doors No
ar: عدد الأبواب

source: Seats No
ar: عدد المقاعد

source: Steering Side
ar: جهة المقود

source: Add
ar: إضافة

source: Phone Number
ar: رقم الهاتف

source: Area
ar: المنطقة

source: Describe Your Car
ar: صف سيارتك

source: Translate
ar: ترجمة

source: Add Main Image
ar: إضافة الصورة الرئيسية

source: Add 19 Images
ar: إضافة 19 صورة

source: Next
ar: التالي

source: Cars Services Ads
ar: إعلانات خدمات السيارات

source: Service Type
ar: نوع الخدمة

source: Service Name
ar: اسم الخدمة

source: Add 3 Images
ar: إضافة 3 صور

source: Real Estate Ads
ar: إعلانات العقارات

source: Contract Type
ar: نوع العقد

source: Property Type
ar: نوع العقار

source: Add 9 Images
ar: إضافة 9 صور

# electronicsAndHomeAppliancesAds
source: Electronics & Home Appliances Ads
ar: إعلانات الإلكترونيات والأجهزة المنزلية

source: Product Name
ar: اسم المنتج

source: Section Type
ar: نوع القسم

source: Add 4 Images
ar: إضافة 4 صور

source: Cars Rent Ads
ar: إعلانات تأجير السيارات

source: Day Rent
ar: الإيجار اليومي

source: Month Rent
ar: الإيجار الشهري

source: Add 10 Images
ar: إضافة 10 صور

source: Restaurants Ads
ar: إعلانات المطاعم

source: No restaurants found
ar: لم يتم العثور على مطاعم

source: Other Services Ads
ar: إعلانات الخدمات الأخرى

source: Jobs Ads
ar: إعلانات الوظائف

source: Category Type
ar: نوع الفئة

source: Job Name
ar: اسم الوظيفة

source: Salary
ar: الراتب

source: Manage Ads
ar: إدارة الإعلانات

source: All
ar: الكل

source: Valid
ar: صالح

source: Pending
ar: قيد المراجعة

source: Expired
ar: منتهي

source: Rejected
ar: مرفوض

source: Post Date
ar: تاريخ النشر

source: Expires In
ar: ينتهي خلال

# views
source: Search & Views
ar: بحث و مشاهدات

source: Refresh
ar: تحديث

source: Edit
ar: تعديل

source: Edit Ad
ar: تعديل الإعلان

source: Renew
ar: تجديد

source: Upgrade
ar: ترقية

source: ADS Type
ar: نوع الإعلان

source: Total ADS
ar: مجموع الإعلانات

source: Balance
ar: الرصيد

# contractExpire
source: Contract Expire (use Ads before) Date
ar: تاريخ انتهاء العقد (استخدم الإعلانات قبل)

source: Amount
ar: المبلغ

source: Days
ar: أيام

source: Pay
ar: دفع

source: Payment
ar: الدفع

source: Total
ar: المجموع

source: Pay With Credit Card
ar: الدفع بالبطاقة الإئتمانية

source: Card Number
ar: رقم البطاقة

source: Expire Date
ar: تاريخ الإنتهاء

source: Card Holder Name
ar: اسم حامل البطاقة

source: Pay Now
ar: ادفع الآن

source: User Id
ar: رقم تعريف المستخدم

source: No Results Found
ar: لا توجد نتائج

source: To
ar: الى

source: Any
ar: أي

source: Apply
ar: تطبيق

source: From
ar: من

source: Reset
ar: إعادة تعيين

source: Choose An Option
ar: اختر خيارًا

source: Password Too Short
ar: كلمة المرور قصيرة جدًا

# passwordsDoNotMatch
source: Passwords Don`t Match
ar: كلمتا المرور غير متطابقتين

source: Account Created Successfully
ar: تم إنشاء الحساب بنجاح

source: Agree Terms Validation
ar: الموافقة على شروط التحقق

source: unknown Error
ar: خطأ غير معروف

source: please Enter Valid Email
ar: الرجاء إدخال بريد إلكتروني صحيح

source: please Enter Phone
ar: الرجاء إدخال رقم الهاتف

source: please Enter Username
ar: الرجاء إدخال اسم المستخدم

source: search Country
ar: البحث عن دولة

source: please Confirm Password
ar: الرجاء تأكيد كلمة المرور

source: no
ar: لا

source: read more
ar: قراءة المزيد

source: show_less
ar: إظهار أقل

source: loading
ar: جار التحميل

source: delete
ar: حذف

source: Please select make
ar: الرجاء اختيار الماركة

source: Please select model
ar: الرجاء اختيار الطراز

source: please_fill_required_fields
ar: الرجاء ملء الحقول المطلوبة

# searchForLocation
source: Search for a location
ar: البحث عن موقع

source: Confirm Location
ar: تأكيد الموقع

source: Pick Location
ar: اختر الموقع

source: Enter Area
ar: ادخل المنطقة

source: Area Name
ar: اسم المنطقة

source: Enter name
ar: ادخل الاسم

source: Enter service name
ar: ادخل اسم الخدمة

source: Enter product name
ar: ادخل اسم المنتج

# enterTitle
source: Enter your title
ar: ادخل العنوان

# enterDescription
source: Enter your description
ar: ادخل الوصف

source: Total price
ar: السعر الإجمالي

# enterContactInfo
source: Enter phone or WhatsApp or email
ar: ادخل رقم الهاتف أو الواتساب أو البريد الإلكتروني

source: Please select all fields
ar: يرجى اختيار جميع الحقول

source: Please select emirate and section type first
ar: يرجى اختيار الإمارة ونوع القسم أولاً

source: Please select emirate and category type
ar: يرجى اختيار الإمارة ونوع الفئة

# please_select_service_type
source: Please select a service type
ar: يرجى اختيار نوع الخدمة

source: Please select section type
ar: يرجى اختيار نوع القسم

source: Secure Your Account
ar: أمّن حسابك

# setPasswordToUpgradeDescription
source: Before upgrading to an Advertiser account, please set a password to safeguard your account and confirm the update.
ar: قبل الترقية إلى حساب معلن، يرجى تعيين كلمة مرور لحماية حسابك وتأكيد التحديث.

source: Set Password
ar: تعيين كلمة المرور

# passwordSetSuccessUpgraded
source: Password set successfully and your account upgraded to advertiser
ar: تم تعيين كلمة المرور بنجاح وتم ترقية حسابك إلى معلن

source: Error setting password
ar: خطأ في تعيين كلمة المرور

source: Incomplete profile
ar: ملفك الشخصي غير مكتمل

# profileWarning
source: You must complete the following fields in your profile before adding the advertisement:
ar: يجب عليك إكمال الحقول التالية في ملفك الشخصي قبل إضافة الإعلان:

source: Warning
ar: تنبيه

# freeAdNotEligibleMessage
source: Free ads are only available for cars priced under {price} AED. Please choose another plan.
ar: الإعلان المجاني متاح فقط للسيارات بسعر أقل من {price} درهم. يرجى اختيار خطة أخرى.

# adDataIncomplete
source: Ad data is incomplete
ar: بيانات الإعلان غير كاملة

# adPublishedSuccessfully
source: Ad posted successfully!
ar: تم نشر الإعلان بنجاح!

# planExpiredOrInactivePleasePay
source: Plan expired or no active plan. Please pay to complete posting
ar: انتهت الباقة أو لا توجد باقة نشطة. يرجى الدفع لإكمال النشر

# errorOccurredWithMessage
source: An error occurred: {message}
ar: حدث خطأ: {message}
